/*Сергей Гусельников
Необходимо реализовать коллекцию, которая имеет фиксированный размер.

Размер задаётся:

    по умолчанию 16
    по указанию пользователя.

Размер коллекции после инициализации меняться не может.

Каждый новый элемент добавляется в конец. После того, как количество элементов достигло максимума -
при добавлении нового элемента коллекция "сдвигается" влево.

1-й элемент удаляется, а каждый следующий смещается на один элемент влево.

Результатом выполнения задания должен быть репозиторий с коллекцией, классом, тестирующим данную коллекцию,
описанием задания и README файлом с инструкцией по запуску приложения
 */
public class AppRuner {
    public static void main(String[] args) {
        MyQueueDemo demo = new MyQueueDemo();

        demo.startDemo();
    }
}
